{
    "format": "layers-model",
    "generatedBy": "keras v3.8.0",
    "convertedBy": "TensorFlow.js Converter v4.22.0",
    "modelTopology": {
        "keras_version": "3.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential_1",
                "trainable": true,
                "dtype": {
                    "module": "keras",
                    "class_name": "DTypePolicy",
                    "config": {
                        "name": "float32"
                    },
                    "registered_name": null
                },
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                377
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer_1"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 3000,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_3",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.2,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 2000,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_4",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.2,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_6",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 1000,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_5",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "rate": 0.2,
                            "seed": null,
                            "noise_shape": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_7",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "units": 773,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ],
                "build_input_shape": [
                    null,
                    377
                ]
            }
        },
        "training_config": {
            "loss": "sparse_categorical_crossentropy",
            "loss_weights": null,
            "metrics": [
                "accuracy"
            ],
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": true,
            "optimizer_config": {
                "class_name": "SGD",
                "config": {
                    "name": "SGD",
                    "learning_rate": 0.009999999776482582,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "momentum": 0.0,
                    "nesterov": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of10.bin",
                "group1-shard2of10.bin",
                "group1-shard3of10.bin",
                "group1-shard4of10.bin",
                "group1-shard5of10.bin",
                "group1-shard6of10.bin",
                "group1-shard7of10.bin",
                "group1-shard8of10.bin",
                "group1-shard9of10.bin",
                "group1-shard10of10.bin"
            ],
            "weights": [
                {
                    "name": "sequential_1/dense_4/kernel",
                    "shape": [
                        377,
                        3000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_4/bias",
                    "shape": [
                        3000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_5/kernel",
                    "shape": [
                        3000,
                        2000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_5/bias",
                    "shape": [
                        2000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_6/kernel",
                    "shape": [
                        2000,
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_6/bias",
                    "shape": [
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_7/kernel",
                    "shape": [
                        1000,
                        773
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "sequential_1/dense_7/bias",
                    "shape": [
                        773
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}